node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 1947511
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\370\003\243\275\367[\254\274\203\034\034\275U\324y<\220K\261=\034f\215=%i\242\275T\266\237=\263\324A\275\343\274\006>{\251\241=\210\302@=\005\275i\275\345\341\376<\312u7>;\341\353\275\346W\034\2752z\341\2753\300\037>t\322x\276yg\217>\376\033\306\2767\255w\276\264\350\321=\026\353A\276\031\2478\275\326\022x=\336\275\365:c\264i\274\251\277\276\275u\304D<\034:5>\353+\221={Cc\276\014\3456\276\307>\263<\324\334\370;\236x\354=\036\340\217>8C\026=;S\241\275\023$\024=`\327\356\275\257n\334\275\236\320a=\337#\336\275\312+\034\276h\2118=\320\014\004>\264\3604>\211\231\021>\036\tX\276\350\323\330\275\265\334\340\275f^\216\274I\030o\275\033\305\317=:\373\263\275-t2=\325\345\321\274M1J\276\210\201\025\276,\000s=\231\321\002=Y\237)\276\270\332\234=\227g\005>\352\0345\276Aq\021><\276\022=3`\220\274\340,\362=#i\016>\033\360v\275\372X\232\275\214\030\031>f\3406=\306)\231=b\025\247>&\002\032\276\236\241L\274j2\370\274g\3342>hq\217>\226\237X\275\345S\373\275\267\222\242=\330\034S>aU\352=\362\227\031>\356\266=>e\345\311\274\036;<>\277\2065>\313>\373<\241\020\025>LD2\274+\003\203=:\005\251=\236J@\275@\362\345\275\315\261\266<\327\273:\276Dg\326<\206\323\233=\201\232\273\275\r(\257=n}\034=\001*\211\275M\252F>D\275\006\276\301\301\263=\021\262X>]\202\200=\316\317\022\275\316E\266\275\371Tr\276\270\300\250\275*\013\240\275\220\255\n\276\016\177i=\032\033\037=\215h\030\274%*z>\2239\222\274|\242\265\275\253\207\300=0&\215\275\362J\271\275\3043\020>F\261\316\275\374\001\325=&\335,\275\313\006\323=\001m+\276~\346\330\275>\030[>a\335\022>\357Q\337<\003\350:\275\300|\232\275\005\250T\275\3010\032=\345tc\276\337F\357\275\'\310w\276\266:J\276\275E\024\274\242\332\326=I\244\010\276\211R\327=\232\356\031>VVF>\205\322\222=\260\327\332=\331\016\251>\214\032\210\275-\3755\275^\277\214\275\'\336\244;n\374\220\275\330\005$\2768M>>q\374O\276\230\010\202\275\035\334W\275\260\031\235\276E\240\035\273\265\261\227;D(\313\2756\265\215=/&\004\275\3010*>^\273\002\276\2234#=\275\257\033>\030X\376=\261\375\363=\036\365\326\275\033E\207\275`\031\010>\237\032N<\220hN>Y\340\372=k\233\266\275\251\273\340=X\333\331\274\242L\201;h\232\307\274\272\355\240=\226>\205=\224\217Q>\rHc\275<%\255\274\003\001\003\276=k\031\276\360\331\327=\033\002\251=\002\003{\273>c\023\276\004\234\032\276\017\355F\276\\\247\306=\375\240\361=7\255\235>\362\212\232=j,8>}Em=g\251\013\276\t\303r\273\237.\245\276T\212:>6\345Q=6\211\221<U\034\024\276C\021\217<\331lt>3\255\242=wZ\273\274\002\032\344<YV\201\275\231\005\031\2758\t\371\274\331\024\360=M\345\333\275SBq>\010\223\205=\245\217\t\276\235\271\370\275\314\220\004\276\335\025\034>\370k\263\275\3462\035\275\361k\031>\007\325\t>\247\347\r>\276\025\203;Y\247\271\275\236V\241\275\350@z\276E\006\235<\006S\013\276(3\337=w\000\035=j\315W\276i\237\315=\242\357\323\275p*\026>\331\340Z\275}\255\014\276\027_\340=d\267>>i$\004>\223\312\274>\340\207\234\274\227\200\345\275T\266\371\274\033\376B\275\320G\371\273\010\372\">d\376\035\276\217m1>\200E\002\275y\244G>\210\023\014\276\375kP=ZL\035=\300$\224\275\"\306\267<\355\3011>\270n\001\276\320\364\217<mQ\276=\225i\202\276\253:\016>\303\267\264=\2039x\274\017\017$\276\243\372\304\274\030|K>\325\260\360\274\302\341D>3g\000>\263\t\367\274\326\361\264:<\221q\275[\317&\276i\237\"=.\271b<RW\326\275\267$B\274MYr\276x^\344=\260\357\236=/ @\276>\024_\276\226k\030\275zx\013\276k\204\240\275\261\357v=\220u\331\275m\264\034>3\242h>N/\020>\376\263\n\276s\"Q>\030>s\275\307\273\264\276\025\250\016\275%\320\006\276\327\213\241\274;;A\276\006J5\275\\`\342<a=\013>\215\360\365=\177\021X\275\243x\026>&@\033\2758\256\366=\233O\352=\357\033A>.\032$\276\277m\273=\3671\222\275\326\262b\276:\324\262=3\005\323\275T\272/\273\033\212\317\275.\227\333\275\300\302\305=\032\257\310=2/\211=I\265+=\3549\017=h\275\'=\334\253+>\322\227\223=\001\302\022\2759~\253\275\232\351:\275\207`\374=\332\362L>\350\312z\275tj%\276^KG\275\334r\351\272\000[\224\274)9\211\274\027q6>O\227\331=\217\324\224\276\003j7>\321\347\316\275\313K\000\276dw\261=\324 I>\264\315\210\275\331\232K\275\227\033\312=\260\330*=\3227d=\265%@\276L\007\267=\256\260\364=\377\374p=\314vs\275M\214\232\275\"y`\275\014\001\341=?\262\235<\257V\320<\023\236]=\347?\265\275\\\223\036;Bqz\275s\362E\274m\255\342\275\310\027\300\274\n<\003=J\376\264\275\243\256!>;\026\000=\3272M\276\014\262\325\275\331\004\236\274\017\265R=d!\267\276x\325\211\276\360\334(\275\240HB>\267\033\267=\355_L>\364T\222=\205q\365\275~\272\t\276\"\371r\276g\035\247=\027\\\022\276\274\201&\276\246g\226>m!F\274\351\345\251\275\266w&>={\217>m\350Y\275\2011\006<)c\247\275\031\312\355=\247\215\243\275.\023\240<\215\265&=\033\364\006>\355\262t\276\027&\377=>!\265\274\272B\027>z=\000\272\322\266\261=Wd\345=\tl\250=&2\022\276\006\323\265\275\314c\275=\000!\216\275\226{\226=t:W>\274\344h\275Y\273+=i\274\216\275!(\037\275\350\247I=\374\364:=\3725\254\274r\245\310\274(q\030\276\374|\n>\002\036A=\216\026\234\273\370[\014\276>S\362=\320\025\330\275\3639Z>\344=\341\276A\t\300\275\037\177s\275f\331\333=\275\3145>\t\003J=\224\026\025\276\235y*\276Q\022\332\275\215\007\254<\337\372k\276Q\367\"=\313v\254=t\177\301=U\235\247=M{,<!2\013\276\235p\017\275h7\335\272\260T\344=\010C\237>\261,\206=:\275\353\274\274\252+\276\330Y\233\275\372\037q\276\331wR>j\325(>r\361u=u)\226=\310f\310<\300\250+>\014\026\034\275\235\343\'=bI\200=:\002\356\275j\001\364\275n\265\276=\307m\200\276\270\321\351\273 7n<\240P\375<{J\216=\264\325\211\2752\016\222\276\322\264!\276\2237]=\3247\365=\341\246\355\275\275\026\373<\217\320l<@T]<&\3747>\365\334\304=I+\032>\347\213 \276\036\261\200=\255\273\023=\351\353\346=]\025\310=\010\336\353=yUm=\271\035\003\276\233,\200=\313\244\271;\363\354\226\273f\300c\275\235\333\317=W35\274\245\274\220\275\317\253\361=\230\nC\276k-\031>\273\031\254\275\3115\215\274T\275L;g\363f>\326\3152>.gZ\276\211\337\320=\321\245K>\237\301]\276g;\035\276U\032c\276\350\213K>\267\2634\276H\024\360\275o\317\322=J4\035<\024q\244=\314\257\000>\032\224\010\275j\303\034>\222\205#>\320\203T\276\236\003\247=y\035!\275\rC >\000\207\313<\01050=f#==\266\334e\276\215\305J\274\002\377A\276$bJ\275%<->0\215C>\261\335\220\276q\020G\275\321\\\325=)`\235<\210\206\001\276\260\235\335=F\243\225=\276\335\032\276\352\027\032\274I\347\245:\272L\"=\r\244\354\273k,#>\272A\007\276z\227\254>\361\244\367\274r(\322;6\0244\273\233\312\322=\211:\312\274\333\266\031\275\000\315\253>\233\003\017>U9\344\275\246&\306=-\177N=H\252K\276\216\275\026>B\374\035\276\273l\331=1\205T\275\"\200\351=\234<\275\275\232\021\303<>\"\240=C\025c\275}\231\032\274}v\017>\224I4<\364%\360\2752%\013\273R\314\271\275\352\347\024>\316\242\211>Ik\001\276\303\\&\276\nM\033\276i\355\221=q\216(=\343q\360<\224\327\025>\377\226\214=\210\307\262=D\313\226\275\244\3266\275H\316\213<9\335\t>4V\007>*\005\204>\304\221\257=\013(\034>z\277\275=\260\276F>\000T\037=\'\300\341\275\016i\322\273\232\346\026\276q\314\222=_\004\377=\376P!\275\327\302\362<\350eA=\367\354i\275\300\377\031\275F \214>\204\361Q>{\323\336=\3252\340=!l]\276\340\201\017>\216\365\021>D\205\340\275@\234s\2747\367\037>\034\331\005\276Y\361\003=@\355\210\275Z&\003>\241\204\017\276d\354\350\275:\317\224\275\357\253\205=ip\220>s\n9\275~\327s\276p\325!\276&\017X\276s\0217\276c\230\300=\215\2366\276\262\324N>\300#\237\275\036\224\255\275\023?\226\274;#V=A\005\275;<0\301=:s\014>\333\274Z\275\034\010e\274c\021\226\276X\202\006\275~4D\2765z\325\275c\345\204\276\323\211\237=L\027\024\275\220T0>\312$\323=\357\023\341\275\020\352_=\272\301L\274_\350\363\275/\270\231=\2753D\276MZ\007>\007\016\026\275\177\373.\2769\341\214\272\350\033x=\323j6\276y\251\360<\366\"\220;J&\024=\014\034\017\276\344N\007>w\350\232;Ps\t=\311 \252=[\340k;I\247z<\353\031Z=a\367\004\276\375\212\326\275\006\014\217=\300\366\261\274\271\253\276\2743}r\275\337\027d\276L\'=\276\244IA=F%\207\274\255\246x\275\355\004?\275\000\202\252\272\315\277\n\275\357\274\003\276\334\305\244\273)\024\251\276\354\274I\275\372(\222>\374\232\031\276\347y\007>|\232F\276I\235\214\276\274<\376=\001<`<k\321\257\275\253m->\274\237~\276\014\243\302\275\\}\302\275\362\346\340=\t\335\226=#\344\236\275\020J\014\276\032:\247;\270\263\026=\334\007{>nx\'\276\343Mm=\354\r\203>\303r\314=\240\005\234\275AH\204\275\332\374\001>8~\236=w\363\331\275g\343\217>\347\206\361\275\231I\232=\251\236\273\275\326)\025\275C]t<\316\n\211=\320\226(=`\347\234>m\215\214\275\274T\020\276p\321\243\275\241\364\016=@)\343=Qf\"<\036\257\235\275\231tV\276\373\203\340\275|;\241<K\337\354=]\346\311=\363[\002=&\030\005<\231\3171\276|\024\004\276U\206\226=\001\310\202\275\226\364\205>\314\373@>\323\251\251\274\254C\352<\214\251J>\362}\212\275\177g\304<\245c\260=\005Q\313=\255ER\275/N\014>\233\221_>\003\036;\276Z\255C=\001]\355\274\003-\221>wS\001=|\014E\2750-\247\275B\231\221=\336kf=Z\213\021\275\226V\221=\246\002o\275\327\271\025\276\336o\260=\336\251\273=\023\033\265=\t\336\363\274\244L\234=\215\275\251>/l\336\275d\3553\275\264\361\270\275\004\234\013\276\200\031 >h\345\'\276\346\275\024\274\255O\331<\222\316\345\275\031\230\257=\205\275\222=$3\n\276\337\215N>c\032\345<\353\351\243=|\2451\274\377\207k\276\340y\326\275p\357\204=(\315\"\275\202\231\007\276\342\313L\276W\352\364\275\302\316\243\275)\tU\276\374SI\276\033q\030\276|\3219>\334d-\2758\241U=\256\032\230\275\244\230\025>\321Y\343=Y\224\215\275S\246\310\275\221\204[\276_y\266=\016\216\303\275E(L>b\0207\275\016\226\002=\030\017\236>\221\002\023=\'!:>\371\010K>\\c`\274\303\n\233>1?\014</\210\024>7<\206<\2436S<\334\310?>\233\330<=\3640\027\276\0161P\273\210M\244=\317\026D\273\366+n\275\014\266\270\275\033\021_\276M\214\004>v\013H\275pl\334\275\331W\340=/>\300\275\276\354p>[\034\371\274\241w\242\274\230\264\321\275\301Fx\274\345v3;:\027\035=+\014\251=\376\335o\276\365\321\'\276\301Gz=\306\005\273\274\232Kq=\261\207\\\276\235\316X\276\230&}\276-\\\225=!\260*\276\330\372\021\275\226=\276<\344\332\017\276\351*:=\303\267\327\275\320\325C\276\223We=3<2>\346\202\220>\200\335B\276\271\235\361\272\277\325\333<\346I9=\323\203\036\275\313\201O\275\247\366C\275\247\224\232=\242=\357\275y|\022>\351\006\n\276\274\003\321\275:\201\334=ZU\214\274\232.\224\276\202\261+\276\240\243\232\275\337\203;=\332\276f=\334\"\307=\326j\210=\014\362\363<`\316?>\244\356\274\275V\177\031>a\2208\275\353\027\345=\366W\305\275\314\367\243=\315\224\207>,\t\243=\034<i=\253\211<<\247!\371\275\006\340P\276\254\276\323=\002\357\r\276\247\374\206\276&\337\034>\004\023\234==\203W\276\336\254a\276\327\242\033\276\265T\355=bS\006\276\360\254\345<\n\207\211<QF(>T\260\237=\214.n=I$\211\276\363\265\013=\324u\020=$0?=\302\310\223=\362\252\034\276\2341->\244f^\274\231N\367=T2G=\336\356\200\274Zx\201\275\031\214\t\276\010\210;=+\347*>\201g\322=\210t\013\276\350<\217\275\362\340\234=\305Ab>\353!d=p\225z>lh$\276\307\233\030\276L\274Q>}t\335<K\226\331;\265\265q\276\251\345\251\275\024\206W\276\243\341\332=\007v\211=\014\366\255=\210]G\276\244s\363=\227Q\n>=\267\205>\216\331\266\274\343s\371\275H\'\335;\271\352+>\024\255G<\262\036\020\275:\270\021<e\265\023\276\2027\350=\2353\375\275td\207=[\253\264\273!\266\235=\255\350\001>\240/\360==@V\275\244n\366=8\240/\276Z\306<=7o6<Hj\347=\345\030j\275C3\220>\\Q\217\275\344\300\303=\3645&=\376\260\026\274p\3228\276e\250\032>g\260(=\306.\360=\031\322\315=\301-\365\275\323\271\264\275\255Z\315\275\314\357B>2\311\200\275;3?>\007D\346\275\242(.>\361\315\232\275\245\'\276\273\337ej=>>`\276\271%\n>\244d\207\276\3222\342\275Lw\010\276\216\211(\275W\231\n>x\334 >\262\224\274\275\343\020*\276\246\032\214>\207;\002\274:\377\251<;\232\353=\n\'\t\276\001:z=\206\206H\275\253fV;de\373=\363\361\226\275\331|\275=&\374G>\272\217\227>\341\225\331\275\tTG\273\357\'3\275\300\316U\275\211*\23299I\024\275\362Z\312=\243dh;\263\214\241\276\253\371\250>\303\244\002>\352\335\332\274\331\256\270=\347\335\200\275\333\0076\275,\017\271=\304\243\021\276K\271?\275P\264\241=3\345\003>\250`\333\274\242\261\255\275=\264F\275x\355\225\275\033A\276=Z\263\001\276#/m\272\023\356\207=.\213\214\275!\344$=\226\326+\273\234f\207\276gm\213=s\177\225=X\016#\276N\254\025\276\202$4>v\346\221\275\253~\201<\230\256q\275\334\024\252>.\362\030<uk\272\275\362\3148=T\343S>1\317\253=\310n\262<\264\005\240=\310\260K>\0065\376\275u\356\243\274\304\323\004\276\026\205\240<TxE>\237G\312=:v\261\275N\353\262=U4\203>~\204*>\002\352\265\275\367\364<\275\211\235e>\350\323\210\275\356(\341=w\3541\276u\016\357=\022-\270\275\254YK=\20093\275\321\030\342;P\006*\276&\252s\275\276\342\342\274Vw\220\275l(\376=\347\244\027\276\264\312D\273\005LE=\017D\250<\232\0140\276\n]\013=[\007\213\276\010\031\260\275\211\267\315<\230PV=;5^\275\016V5>Y\312\014\276\025\245G\275\000zu=\322c4>\262q\305\275\3105\254\275n\276?\275\254\240\032>\313\354\215>{\376\375<\203\003s\276\341w\022>a\251\312;\212\020+>Hp\345<,\224\'\276\226\376\364\276\201\336e<\361y\312\275\250f\316<\300\017\225\274P]\203\276N\223K=\260\200\262\275?>\022\2753,O=\251L\333=\020 \030\276Jw\022>\222[h\275\223\326\354\275\027\355\n\274\305y\020\275\211\345\375:\013\262\204=\'\273$\274\237Z\357=+\'\334\274\342\032\374=\027\017\210\276vF\013\275\024\n\274=*\312Q>S\n\201\275\207\377\242\275\337\373=>\2317\235=\002.C\275\204\201;>\007\334\023>\322\027\007>\005Z\224=R\316\006>\377|\370=\276\334\271=\245\000\016>\362]\025\276$\0237>\217\252\277\274\314\037!>\250$!\276\2131\312;V=(\276\243\031n=\004\353\370\274PcW\275\320S\226=\271\262\010\276\342\300M=\213\302\034>\375;\260<"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "ClipByValue"
  input: "net/add_1"
  input: "net/Const_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "ClipByValue"
  input: "net/add_3"
  input: "net/Const_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
  attr {
    key: "identical_element_shapes"
    value {
      b: true
    }
  }
  attr {
    key: "tensor_array_name"
    value {
      s: "output_ta"
    }
  }
}
node {
  name: "net/TensorArray_1"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
